Netology/src/DataProcessors/РасчетПремий/РасчетПремий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>РасчетПремий</name>
  <attributes>
    <name>ПроцентНаУслуги</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентНаТовары</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСКоторойСчитать</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДоКоторойСчитать</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТаблицаПремий</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ПродажиТоваров</name>
      <type>
        <types>DefinedType.Денежный</types>
      </type>
    </attributes>
    <attributes>
      <name>ПремияЗаПродажуТоваров</name>
      <type>
        <types>DefinedType.Денежный</types>
      </type>
    </attributes>
    <attributes>
      <name>ПродажиУслуг</name>
      <type>
        <types>DefinedType.Денежный</types>
      </type>
    </attributes>
    <attributes>
      <name>ПремияЗаПродажиУслуг</name>
      <type>
        <types>DefinedType.Денежный</types>
      </type>
    </attributes>
    <attributes>
      <name>Премия</name>
      <type>
        <types>DefinedType.Денежный</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

Netology/src/AccumulationRegisters/Продажи/Продажи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Продажи</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Денежный</types>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Netology/src/Enums/ТипыНоменклатуры/ТипыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыНоменклатуры</name>
  <enumValues>
    <name>Товар</name>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
  </enumValues>
</mdclass:Enum>

Netology/src/DataProcessors/РасчетПремий/Forms/Форма/Module.bsl
&НаСервере
Процедура РассчитатьНаСервере()
	
	Объект.ТаблицаПремий.Очистить();
	
	ТаблицаОборотовПоСотрудникам = РегистрыНакопления.Продажи.Обороты(Объект.ДатаСКоторойСчитать, Объект.ДатаДоКоторойСчитать);
	
	Для Каждого СтрокаОборот Из ТаблицаОборотовПоСотрудникам Цикл
		
		Поиск = Новый Структура;
		Поиск.Вставить("Сотрудник", СтрокаОборот.Сотрудник);
		НайденныеСтроки = Объект.ТаблицаПремий.НайтиСтроки(Поиск);
		
		Если НайденныеСтроки.Количество() > 0 Тогда
			
			НоваяСтрока = НайденныеСтроки[0];
			
		Иначе
			
			НоваяСтрока = Объект.ТаблицаПремий.Добавить();
			НоваяСтрока.Сотрудник = СтрокаОборот.Сотрудник;
			
		КонецЕсли; 
		
		Если СтрокаОборот.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Товар Тогда
			
			НоваяСтрока.ПродажиТоваров = НоваяСтрока.ПродажиТоваров + СтрокаОборот.Сумма;
			НоваяСтрока.ПремияЗаПродажуТоваров = НоваяСтрока.ПремияЗаПродажуТоваров + СтрокаОборот.Сумма * (Объект.ПроцентНаТовары * 0.01);
			
		Иначе
			
			НоваяСтрока.ПродажиУслуг = НоваяСтрока.ПродажиУслуг + СтрокаОборот.Сумма;
			НоваяСтрока.ПремияЗаПродажиУслуг = НоваяСтрока.ПремияЗаПродажиУслуг + СтрокаОборот.Сумма * (Объект.ПроцентНаУслуги * 0.01);
			
		КонецЕсли; 
		
		НоваяСтрока.Премия = НоваяСтрока.ПремияЗаПродажуТоваров + НоваяСтрока.ПремияЗаПродажиУслуг;
		
	КонецЦикла;
				
КонецПроцедуры

&НаКлиенте
Процедура Рассчитать(Команда)
	РассчитатьНаСервере();
КонецПроцедуры
